app/views/users/content.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<h2>コメント</h2>
<%= @post.comments.each.reverse_each do |comment| %>