app/views/users/index.html.erb

  <p> No.<%= post.id %>: <%= post.text%> <%= link_to '[コメント]', controller:'users', action:'content', id: post.id  %> </p>
  <p> 投稿時間:<%= post.created_at %> | <%= link_to 'いいね', controller:'posts', action:'edit', id: post.id %> : <%= post.fav %>  | コメント:<%= post.comments.count %> </p> <br>
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]