app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("opinion", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["opinion", "good morning too"], ["post_id", 1], ["created_at", "2017-08-20 10:14:24.875013"], ["updated_at", "2017-08-20 10:14:24.875013"]]