app/controllers/posts_controller.rb

INSERT INTO "posts" ("text", "fav", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "sleepy"], ["fav", 0], ["created_at", "2017-08-20 06:07:47.379796"], ["updated_at", "2017-08-20 06:07:47.379796"]]
---
  def create
    @post = Post.new(post_params)
    @post.fav = 0
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "fav" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["fav", 1], ["updated_at", "2017-08-20 11:40:28.581666"], ["id", 2]]
---
  def edit
    @post = Post.find(params[:id])
    @post.increment(:fav)